// stores/reviews.ts
import { defineStore } from "pinia"

export const useReviewsStore = defineStore("reviews", {
  state: () => ({
    reviews: [
      {
        id: 1,
        user: "Олена К.",
        content:
          "«Довго не могла знайти косметику, яка підійшла б моїй чутливій шкірі, аж поки не відкрила для себе ваш бренд. Асортимент дуже різноманітний, а якість — на висоті!»",
        rating: 5,
        date: "14 грудня 2025",
      },
      {
        id: 2,
        user: "Марія С.",
        content:
          "«Я в захваті від доглядової косметики, яку замовила! Креми, сироватки, навіть очищення — усе працює ідеально. Шкіра стала більш зволоженою та доглянутою.»",
        rating: 4,
        date: "15 грудня 2025",
      },
      {
        id: 3,
        user: "Ірина Л.",
        content:
          "«Ця тональна основа — мастхев! Лягає легко, не забиває пори, а вигляд обличчя — як після роботи візажиста. Дуже задоволена покупкою.»",
        rating: 5,
        date: "16 грудня 2025",
      },
      {
        id: 4,
        user: "Вікторія П.",
        content:
          "«Як людина, що цінує мінімалізм та якість, я у захваті від дизайну та ефективності вашої косметики. Від кремів до масок — усе створено з увагою до деталей.»",
        rating: 5,
        date: "17 грудня 2025",
      },
      {
        id: 5,
        user: "Наталія М.",
        content:
          "«Цей набір для догляду — ідеальне поєднання аромату, текстури та результату. Шкіра стала м'якою, свіжою та сяючою. Відчувається, що над продуктами працювали професіонали.»",
        rating: 4,
        date: "18 грудня 2025",
      },
      {
        id: 6,
        user: "Катерина Д.",
        content:
          "«Обожнюю вашу косметику! Особливо сироватку — ефект помітний уже після кількох застосувань. Як дизайнер, оцінюю ще й упаковку — вона стильна й дуже приємна на дотик.»",
        rating: 5,
        date: "19 грудня 2025",
      },
    ],
  }),
})
